Tekla Open API Reference for Tekla Structures 2025
IUIEvents.DrawingEditorOpened Event
 The DrawingEditorOpened event is raised when the drawing editor is opened.
 Namespace: Tekla.Structures.Drawing.UI
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
event Events.DrawingEditorOpenedDelegate DrawingEditorOpened
Event DrawingEditorOpened As Events.DrawingEditorOpenedDelegate
Value
Type: Tekla.Structures.Drawing.UI.Events.DrawingEditorOpenedDelegate
See Also
Reference
IUIEvents Interface
Tekla.Structures.Drawing.UI Namespace